In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods=6)
print(dates)

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DateFrame(np.random.randn(6, 4), Index=dates, columns=['A', 'B', 'C', 'D'])
df

AttributeError: module 'pandas' has no attribute 'DateFrame'

In [5]:
df = pd.DateFrame(np.random.randn(6, 4), index=dates, columns=['A', 'B', 'C', 'D'])
df

AttributeError: module 'pandas' has no attribute 'DateFrame'

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2013-01-01  0.145029 -0.390921 -0.090410 -0.537084
2013-01-02 -0.435079 -1.403081  0.402125 -0.782612
2013-01-03 -0.645599  0.151931 -0.391337  0.740280
2013-01-04 -0.229196 -1.194715  0.997049  0.155026
2013-01-05 -1.936385 -0.158062  0.965891  2.293131
2013-01-06  0.365226  0.676185  2.106539 -0.433196

In [7]:
df.head(3)

                   A         B         C         D
2013-01-01  0.145029 -0.390921 -0.090410 -0.537084
2013-01-02 -0.435079 -1.403081  0.402125 -0.782612
2013-01-03 -0.645599  0.151931 -0.391337  0.740280

In [8]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [10]:
df.values

array([[ 0.14502895, -0.39092134, -0.09040983, -0.5370844 ],
       [-0.43507906, -1.40308088,  0.40212518, -0.78261152],
       [-0.64559944,  0.1519312 , -0.39133705,  0.74027956],
       [-0.22919647, -1.19471515,  0.99704895,  0.1550264 ],
       [-1.93638511, -0.15806156,  0.96589073,  2.2931315 ],
       [ 0.36522636,  0.67618479,  2.10653867, -0.43319597]])

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [12]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.456001 -0.386444  0.664976  0.239258
std    0.814250  0.794740  0.898267  1.146790
min   -1.936385 -1.403081 -0.391337 -0.782612
25%   -0.592969 -0.993767  0.032724 -0.511112
50%   -0.332138 -0.274491  0.684008 -0.139085
75%    0.051473  0.074433  0.989259  0.593966
max    0.365226  0.676185  2.106539  2.293131

In [13]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-06  0.365226  0.676185  2.106539 -0.433196
2013-01-03 -0.645599  0.151931 -0.391337  0.740280
2013-01-05 -1.936385 -0.158062  0.965891  2.293131
2013-01-01  0.145029 -0.390921 -0.090410 -0.537084
2013-01-04 -0.229196 -1.194715  0.997049  0.155026
2013-01-02 -0.435079 -1.403081  0.402125 -0.782612

In [14]:
df['A']

2013-01-01    0.145029
2013-01-02   -0.435079
2013-01-03   -0.645599
2013-01-04   -0.229196
2013-01-05   -1.936385
2013-01-06    0.365226
Freq: D, Name: A, dtype: float64

In [15]:
df[0:3]

                   A         B         C         D
2013-01-01  0.145029 -0.390921 -0.090410 -0.537084
2013-01-02 -0.435079 -1.403081  0.402125 -0.782612
2013-01-03 -0.645599  0.151931 -0.391337  0.740280

In [16]:
df['20130102' : '20130104']

                   A         B         C         D
2013-01-02 -0.435079 -1.403081  0.402125 -0.782612
2013-01-03 -0.645599  0.151931 -0.391337  0.740280
2013-01-04 -0.229196 -1.194715  0.997049  0.155026

In [17]:
df.loc[dates[0]]

A    0.145029
B   -0.390921
C   -0.090410
D   -0.537084
Name: 2013-01-01 00:00:00, dtype: float64

In [18]:
df.loc[:,['A', 'B']]

                   A         B
2013-01-01  0.145029 -0.390921
2013-01-02 -0.435079 -1.403081
2013-01-03 -0.645599  0.151931
2013-01-04 -0.229196 -1.194715
2013-01-05 -1.936385 -0.158062
2013-01-06  0.365226  0.676185

In [19]:
df.loc['20130102' : '20130104', ['A', 'B']]

                   A         B
2013-01-02 -0.435079 -1.403081
2013-01-03 -0.645599  0.151931
2013-01-04 -0.229196 -1.194715

In [20]:
df.loc['20130102', ['A', 'B']]

A   -0.435079
B   -1.403081
Name: 2013-01-02 00:00:00, dtype: float64

In [21]:
df.loc[" 20130102", ["A", "B"]]

A   -0.435079
B   -1.403081
Name: 2013-01-02 00:00:00, dtype: float64

In [22]:
df.loc[dates[0], 'A']

0.14502894873525057

In [23]:
df.iloc[3]

A   -0.229196
B   -1.194715
C    0.997049
D    0.155026
Name: 2013-01-04 00:00:00, dtype: float64

In [24]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.229196 -1.194715
2013-01-05 -1.936385 -0.158062

In [25]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.435079  0.402125
2013-01-03 -0.645599 -0.391337
2013-01-05 -1.936385  0.965891

In [26]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.435079 -1.403081  0.402125 -0.782612
2013-01-03 -0.645599  0.151931 -0.391337  0.740280

In [27]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.390921 -0.090410
2013-01-02 -1.403081  0.402125
2013-01-03  0.151931 -0.391337
2013-01-04 -1.194715  0.997049
2013-01-05 -0.158062  0.965891
2013-01-06  0.676185  2.106539

In [28]:
df[df.A>0]

                   A         B         C         D
2013-01-01  0.145029 -0.390921 -0.090410 -0.537084
2013-01-06  0.365226  0.676185  2.106539 -0.433196

In [29]:
df[df>0]

                   A         B         C         D
2013-01-01  0.145029       NaN       NaN       NaN
2013-01-02       NaN       NaN  0.402125       NaN
2013-01-03       NaN  0.151931       NaN  0.740280
2013-01-04       NaN       NaN  0.997049  0.155026
2013-01-05       NaN       NaN  0.965891  2.293131
2013-01-06  0.365226  0.676185  2.106539       NaN

In [30]:
df2 = df.copy()

In [31]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
print(df2)

                   A         B         C         D      E
2013-01-01  0.145029 -0.390921 -0.090410 -0.537084    one
2013-01-02 -0.435079 -1.403081  0.402125 -0.782612    one
2013-01-03 -0.645599  0.151931 -0.391337  0.740280    two
2013-01-04 -0.229196 -1.194715  0.997049  0.155026  three
2013-01-05 -1.936385 -0.158062  0.965891  2.293131   four
2013-01-06  0.365226  0.676185  2.106539 -0.433196  three

In [32]:
df2['E'].isin(['two', 'four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool